## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: gcp/prod
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_secret.loadtesting-manager will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_secret" "loadtesting-manager" {
+       data      = (sensitive value)
+       id        = (known after apply)
+       immutable = (known after apply)
+       type      = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # argocd_cluster.gcp-loadtesting will be created
+   resource "argocd_cluster" "gcp-loadtesting" {
+       id     = (known after apply)
+       info   = (known after apply)
+       name   = "gcp-loadtesting"
+       server = (sensitive)

+       config {
+           bearer_token = (sensitive value)

+           tls_client_config {
+               ca_data = (known after apply)
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.loadtesting-manager will be created
+   resource "kubernetes_secret" "loadtesting-manager" {
+       data                           = (sensitive value)
+       id                             = (known after apply)
+       type                           = "kubernetes.io/service-account-token"
+       wait_for_service_account_token = true

+       metadata {
+           annotations      = {
+               "kubernetes.io/service-account.name" = "loadtesting-manager"
            }
+           generation       = (known after apply)
+           name             = "loadtesting-manager"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:gcp/prod workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 635.76 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| gcp/prod | default | 0.00 | 635.76 | 635.76|
| | **Total** | **0.00** | **635.76** | **635.76** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
